learning_style_questions = [
    {
        "text": "Якщо мені потрібно знайти дорогу до мовної школи “Soulmate” за порадою друга, то я:\n"
                "K. з’ясую, чи не знаходиться школа поряд з місцем, яке мені відоме\n"
                "A. запитаю у друга, як пройти\n"
                "R. запишу маршрут, який мені потрібно запам’ятати\n"
                "V. скористаюся GPS",
        "options": ["K", "A", "R", "V"]
    },
    {
        "text": "Я підключився до уроку англійської мови. Мій вчитель на онлайн-уроці намагається пояснити мені різницю між часами в англійській мові, демонструє кілька таблиць, деякі схеми, виписує конструкції та слова. Найкраще я би навчився, якщо б я:\n"
                "V. переглядав схеми\n"
                "A. слухав\n"
                "R. читав слова\n"
                "K. Брав участь в обговоренні",
        "options": ["V", "A", "R", "K"]
    },
    {
        "text": "Якщо я хочу дізнатися більше про мовний курс, на який збираюся, то я:\n"
                "K. зверну увагу на подробиці стосовно цікавих моментів та плану занять\n"
                "V. скористаюся сайтом та перегляну фото та відео\n"
                "R. прочитаю про те, що написано в інтернеті\n"
                "A. поговорю з особою, яка вже проходила цей курс, або з іншими людьми, які туди збираються",
        "options": ["K", "V", "R", "A"]
    },
    {
        "text": "Коли я обираю спосіб навчання, для мене важливо:\n"
                "K. Застосування знань у реальних ситуаціях\n"
                "A. Спілкування з іншими у формі дискусії\n"
                "V. Робота з малюнками, таблицями чи графіками\n"
                "R. Мати змогу вільно читати та розуміти написане",
        "options": ["K", "A", "V", "R"]
    },
    {
        "text": "Під час навчання мові я:\n"
                "A. люблю проговорювати матеріал\n"
                "V. спираюся на закономірності\n"
                "K. використовую практичні приклади\n"
                "R. читаю книги, статті та роздатковий матеріал",
        "options": ["A", "V", "K", "R"]
    },
    {"text": "Якщо я хочу заощадити і обираю між різними варіантами курсів, то я:\n"
             "K. розгляну приклади кожного курсу, порівнюючи їх та візьму пробні уроки\n"
             "R. прочитаю опис кожного, де детально описані всі основні моменти\n"
             "V. Подивлюсь на статистику відвідувань та їх популярності\n"
             "A. поговорю з експертом про найкращий варіант",
     "options": ["K", "R", "V", "A"]},

    {"text": "Якщо я хочу опанувати нову граматичну тему, я скоріш за все захочу:\n"
             "K. подивитися, як займаються інші учні, перш ніж приєднатися\n"
             "A. послухати, як пояснює матеріал вчитель, і задати свої запитання\n"
             "V. Ознайомитись зі схемами, формулами та основними прикладами вживання\n"
             "R. Прочитати усі правила",
     "options": ["K", "A", "V", "R"]},

    {"text": "У мене проблема з вимовою. Я б хотів, щоб вчитель:\n"
             "R. дав мені щось прочитати, щоб пояснити, в чому проблема\n"
             "K. використав пластикову модель ротової порожнини, щоб показати мені в чому проблема вимови того чи іншого звуку та де він розташований\n"
             "A. описав, в чому проблема\n"
             "V. показав мені транскрипцію проблематичного слова",
     "options": ["R", "K", "A", "V"]},

    {"text": "Я хочу опанувати нову платформу для роботи на уроці. Для цього я буду:\n"
             "R. читати письмові інструкції, що додаються\n"
             "A. радитися з людьми, які знають цю платформу\n"
             "K. користуватися і вчитися за допомогою метода проб і помилок\n"
             "V. спиратися на візуальну схему",
     "options": ["R", "A", "K", "V"]},

    {"text": "Коли я навчаюся онлайн, мені важливо:\n"
             "K. Відеозапис та можливість переглянути урок знову\n"
             "V. цікавий дизайн та наявність візуальної інформації\n"
             "R. цікаві письмові описи, списки та пояснення\n"
             "A. аудіоканали, де я можу слухати подкасти чи інтерв'ю",
     "options": ["K", "V", "R", "A"]},
    {"text": "Якщо я хочу навчитися краще писати тексти, то я буду:\n"
             "A. ставити запитання та спілкуватися про той чи інший текст та його особливості\n"
             "R. використовувати письмові інструкції\n"
             "V. використовувати схеми, що демонструють покрокове написання тексту та те, за що відповідає кожна його частина\n"
             "K. використовувати приклади хороших і поганих написаних текстів, які показують, як потрібно писати правильно",
     "options": ["A", "R", "V", "K"]},

    {"text": "Мені більше до вподоби викладач, який використовує:\n"
             "K. демонстрації, моделі або практичні завдання\n"
             "A. запитання та відповіді, розмову, групову дискусію\n"
             "R. роздатковий матеріал, книги або матеріали для читання\n"
             "V. таблиці, схеми, транскрипції чи графіки",
     "options": ["K", "A", "R", "V"]},
    {"text": "Я завершив/ла тест, і я хочу отримати відгук. Я хотів/ла би отримати відгук:\n"
             "K. з використанням прикладів із того, що було зроблено\n"
             "R. з використанням письмового опису моїх результатів\n"
             "A. у формі проговорення результатів\n"
             "V. з використанням графіків, що показують, чого я досяг/ла",
     "options": ["K", "R", "A", "V"]}
]
# dd